app/controllers/days_controller.rb

  def index
    respond_to do |format|
      format.html
      format.json { render json: Day.all}
---
SELECT "days".* FROM "days"