app/controllers/exercises_controller.rb

  def index
    @day = Day.find(params[:name])
    @exercises = @day.exercises.all
---
SELECT "exercises".* FROM "exercises"  ORDER BY updated_at DESC